In [2]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.3'

In [3]:
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
s.values

array([10, 20, 30, 40, 50])

In [5]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# Using Labels

labelled_data=pd.Series([1, 'John', 3.5,'Hey'], index = ['a','b','c','d'])
print(labelled_data)

a       1
b    John
c     3.5
d     Hey
dtype: object

In [7]:
labelled_data[0]

/var/folders/y5/5lrz8v6s505c09js64f3pkb00000gn/T/ipykernel_91171/3855525365.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  labelled_data[0]

1

In [8]:
labelled_data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
score={'Jane':90,'Bill':80,'Elon': 85,'Tom':75,'Tim':95, 'Gp': None}
names=pd.Series(score) #Convert to series
names

Jane    90.0
Bill    80.0
Elon    85.0
Tom     75.0
Tim     95.0
Gp       NaN
dtype: float64

In [10]:
names['Tim']

np.float64(95.0)

### Boolean Indexing
filter elements using conditional logic:

In [11]:
names[names>=85]

Jane    90.0
Elon    85.0
Tim     95.0
dtype: float64

In [12]:
names['Tom'] = 60

In [13]:
names[names <= 80] = 83
names

Jane    90.0
Bill    83.0
Elon    85.0
Tom     83.0
Tim     95.0
Gp       NaN
dtype: float64

In [14]:
'Tom' in names

True

In [15]:
names['gagan'] = 20

In [16]:
if 'gagan' in names:
    print('hello')
else:
    print('Not there')

hello

In [17]:
data = pd.Series([1,2,np.nan,4,5])
print(data.mean())
print(data.mean(skipna=True))

3.0
3.0

In [18]:
names.isnull() # Returns a boolean Series

Jane     False
Bill     False
Elon     False
Tom      False
Tim      False
Gp        True
gagan    False
dtype: bool

In [19]:
names

Jane     90.0
Bill     83.0
Elon     85.0
Tom      83.0
Tim      95.0
Gp        NaN
gagan    20.0
dtype: float64

In [20]:
names.isna()

Jane     False
Bill     False
Elon     False
Tom      False
Tim      False
Gp        True
gagan    False
dtype: bool

In [21]:
names.dropna()

Jane     90.0
Bill     83.0
Elon     85.0
Tom      83.0
Tim      95.0
gagan    20.0
dtype: float64

In [22]:
names.dropna(inplace=True)

In [23]:
names

Jane     90.0
Bill     83.0
Elon     85.0
Tom      83.0
Tim      95.0
gagan    20.0
dtype: float64

In [24]:
names['gagan']=np.nan

In [25]:
names

Jane     90.0
Bill     83.0
Elon     85.0
Tom      83.0
Tim      95.0
gagan     NaN
dtype: float64

In [26]:
names.fillna(0)

Jane     90.0
Bill     83.0
Elon     85.0
Tom      83.0
Tim      95.0
gagan     0.0
dtype: float64

In [27]:
import pandas as pd

data = {
    "name": ["Bill", "Tom", "Tim", "John", "Alex", "Vanessa", "Kate"],
    "score": (90, 80, 85, 75, 95, 60, 65),
    "sport": ["Wrestling", "Football", "Skiing", "Swimming", "Tennis", "Karete", "Surfing"],
    "sex": ["M", "M", "M", "M", "F", "F", "F"]
}

df = pd.DataFrame(data)
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [28]:
# Accessing a specific row  by index
print(df.iloc[2]) # Third row (index 2)

name        Tim
score        85
sport    Skiing
sex           M
Name: 2, dtype: object

In [29]:
# Accessing a range of rows using slicing
print(df.iloc[1:4, 0:2]) # Rows with indices 1,2,3

   name  score
1   Tom     80
2   Tim     85
3  John     75

#### Indexing with .loc[] and .iloc[]
.loc[] : Label-based Indesing.

.iloc : Position-based indexing.

In [30]:
df.set_index('name', inplace=True)

In [31]:
df

         score      sport sex
name
Bill        90  Wrestling   M
Tom         80   Football   M
Tim         85     Skiing   M
John        75   Swimming   M
Alex        95     Tennis   F
Vanessa     60     Karete   F
Kate        65    Surfing   F

In [32]:
#df.reset_index(inplace=True)
#df

In [33]:
# Accessing row by label (name)
print(df.loc['Bill']) # Row with index 1

score           90
sport    Wrestling
sex              M
Name: Bill, dtype: object

In [34]:
# Accessing specific value using labels
print(df.loc['Bill', 'score']) # score of the person at index 1

90

In [35]:
# Accessing row by integer position
print(df.iloc[1]) # Second row (index 1)

score          80
sport    Football
sex             M
Name: Tom, dtype: object

In [36]:
# Accessing specific value using integer positions
print(df.iloc[1, 2]) # Element at row 1, column 1

M

In [37]:
print(df.iloc[1, [0,2]]) # Element at row 1. column 0 and 2

score    80
sex       M
Name: Tom, dtype: object

### Slicing
-- with .loc[]: Both start and stop indices are included

-- with .iloc[]: The stop is excluded

In [38]:
# loc or iloc [row slicing, column slicing]

In [39]:
df

         score      sport sex
name
Bill        90  Wrestling   M
Tom         80   Football   M
Tim         85     Skiing   M
John        75   Swimming   M
Alex        95     Tennis   F
Vanessa     60     Karete   F
Kate        65    Surfing   F

In [40]:
# using .loc for slicing (inclusive of end)
print(df.loc['Bill': 'Tim', 'score':'sex'])

      score      sport sex
name
Bill     90  Wrestling   M
Tom      80   Football   M
Tim      85     Skiing   M

In [41]:
# using .iloc for slicing (exclusive of end)
print(df.iloc[1:3, 0:2])

      score     sport
name
Tom      80  Football
Tim      85    Skiing

#### Filtering Data (Boolean Indexing)

In [42]:
# Filtering based on a condition (e.g., score > 80)
df[df['sex'] == 'M']

      score      sport sex
name
Bill     90  Wrestling   M
Tom      80   Football   M
Tim      85     Skiing   M
John     75   Swimming   M

In [43]:
# Filtering based on multiple conditions
print(df[(df['score'] > 80) & (df['sex'] == 'M')])

      score      sport sex
name
Bill     90  Wrestling   M
Tim      85     Skiing   M

#### Sorting Data

In [44]:
# Sorting by score
print(df.sort_values('score', ascending=False))

         score      sport sex
name
Alex        95     Tennis   F
Bill        90  Wrestling   M
Tim         85     Skiing   M
Tom         80   Football   M
John        75   Swimming   M
Kate        65    Surfing   F
Vanessa     60     Karete   F

In [ ]:
# Sorting by multiple columns (first by sex, then by score)
# The data is grouped by sex and each group is sorted by score
print(df.sort_values(by=['sex', 'score'], ascending=[True, False]))

         score      sport sex
name
Alex        95     Tennis   F
Kate        65    Surfing   F
Vanessa     60     Karete   F
Bill        90  Wrestling   M
Tim         85     Skiing   M
Tom         80   Football   M
John        75   Swimming   M